Repository: snufkinx/salary_compare
Catalog: translations/locale/*/LC_MESSAGES/salary_compare.po
Languages: ar, he, ru

source: Salary Comparison Tool
ar: أداة مقارنة الرواتب
he: כלי השוואת משכורות
ru: Инструмент сравнения зарплат

source: Compare net salaries across different countries and employment types
ar: قارن الرواتب الصافية عبر دول مختلفة وأنواع التوظيف
he: השווה משכורות נטו בין מדינות שונות וסוגי תעסוקה
ru: Сравните чистые зарплаты в разных странах и типах занятости

source: Configuration
ar: الإعدادات
he: הגדרות
ru: Настройки

source: Gross Salary (€)
ar: الراتب الإجمالي (€)
he: משכורת ברוטו (€)
ru: Валовая зарплата (€)

source: Display Currency
ar: عملة العرض
he: מטבע תצוגה
ru: Валюта отображения

source: Choose display currency:
ar: اختر عملة العرض:
he: בחר מטבע תצוגה:
ru: Выберите валюту отображения:

source: Select Tax Regimes
ar: اختر أنظمة الضرائب
he: בחר משטרי מס
ru: Выберите налоговые режимы

source: Summary Comparison
ar: المقارنة الملخصة
he: השוואה סיכומית
ru: Сводное сравнение

source: Comparison Chart
ar: مخطط المقارنة
he: תרשים השוואה
ru: Диаграмма сравнения

source: Detailed Breakdowns
ar: التفاصيل المفصلة
he: פירוט מפורט
ru: Детальная разбивка

source: Country Comparison
ar: مقارنة الدول
he: השוואה לפי מדינות
ru: Сравнение по странам

source: Salary Progression
ar: تطور الراتب
he: התקדמות משכורת
ru: Прогрессия зарплаты

source: Calculating salaries...
ar: حساب الرواتب...
he: מחשב משכורות...
ru: Расчет зарплат...

source: Please select at least one tax regime from the sidebar to see calculations.
ar: يرجى اختيار نظام ضريبي واحد على الأقل من الشريط الجانبي لرؤية الحسابات.
he: אנא בחר לפחות משטר מס אחד מהסרגל הצדדי כדי לראות חישובים.
ru: Пожалуйста, выберите хотя бы один налоговый режим в боковой панели для просмотра расчетов.

source: Change inputs in the sidebar to see real-time updates
ar: غيّر المدخلات في الشريط الجانبي لرؤية التحديثات الفورية
he: שנה קלטים בסרגל הצדדי כדי לראות עדכונים בזמן אמת
ru: Измените входные данные в боковой панели для просмотра обновлений в реальном времени

source: Country
ar: البلد
he: מדינה
ru: Страна

source: Gross Annual
ar: سنوي إجمالي
he: שנתי ברוטו
ru: Валовая годовая

source: Net Annual
ar: سنوي صافي
he: שנתי נטו
ru: Чистая годовая

source: Gross Monthly
ar: شهري إجمالي
he: חודשי ברוטו
ru: Валовая месячная

source: Net Monthly
ar: شهري صافي
he: חודשי נטו
ru: Чистая месячная

source: Tax %
ar: ضريبة %
he: מס %
ru: Налог %

source: Gross Salary
ar: الراتب الإجمالي
he: משכורת ברוטו
ru: Валовая зарплата

source: Net Salary
ar: الراتب الصافي
he: משכורת נטו
ru: Чистая зарплата

source: Monthly Net
ar: صافي شهري
he: נטו חודשי
ru: Месячная чистая

source: Effective Tax
ar: الضريبة الفعالة
he: מס אפקטיבי
ru: Эффективный налог

source: Tax Base
ar: قاعدة الضريبة
he: בסיס מס
ru: Налоговая база

source: Deductions
ar: الخصومات
he: ניכויים
ru: Вычеты

source: Deduction
ar: خصم
he: ניכוי
ru: Вычет

source: Amount
ar: المبلغ
he: סכום
ru: Сумма

source: Rate
ar: المعدل
he: שיעור
ru: Ставка

source: Details
ar: التفاصيل
he: פרטים
ru: Детали

source: Income Tax Brackets
ar: شرائح ضريبة الدخل
he: מדרגות מס הכנסה
ru: Налоговые ставки подоходного налога

source: Bracket
ar: شريحة
he: מדרגה
ru: Ставка

source: Taxable Amount
ar: المبلغ الخاضع للضريبة
he: סכום חייב במס
ru: Облагаемая сумма

source: Tax Amount
ar: مبلغ الضريبة
he: סכום מס
ru: Сумма налога

source: Tax Rate %
ar: معدل الضريبة %
he: שיעור מס %
ru: Налоговая ставка %

source: Countries
ar: الدول
he: מדינות
ru: Страны

source: Net Salary (€)
ar: الراتب الصافي (€)
he: משכורת נטו (€)
ru: Чистая зарплата (€)

source: Tax Rate (%)
ar: معدل الضريبة (%)
he: שיעור מס (%)
ru: Налоговая ставка (%)

source: Net Salary vs Gross Salary Progression
ar: تطور الراتب الصافي مقابل الإجمالي
he: התקדמות משכורת נטו מול ברוטו
ru: Прогрессия чистой зарплаты против валовой

source: Current
he: נוכחי
ru: Текущая

source: € Euro
ar: € يورو
he: € יורו
ru: € Евро

source: $ US Dollar
ar: $ دولار أمريكي
he: $ דולר אמריקאי
ru: $ Доллар США

source: £ British Pound
ar: £ جنيه إسترليني
he: £ לירה שטרלינג
ru: £ Британский фунт

source: Kč Czech Koruna
ar: Kč كرونة تشيكية
he: Kč קורונה צ'כית
ru: Kč Чешская крона

source: ₪ Israeli Shekel
ar: ₪ شيكل إسرائيلي
he: ₪ שקל ישראלי
ru: ₪ Израильский шекель

source: lei Romanian Leu
ar: lei ليو روماني
he: lei לאו רומני
ru: lei Румынский лей

source: лв Bulgarian Lev
ar: лв ليف بلغاري
he: лв לב בולגרי
ru: лв Болгарский лев

source: Pension Insurance
ar: بيمو التأمين على التقاعد
he: ביטוח פנסיה
ru: Пенсионное страхование

source: Mandatory pension insurance contribution
ar: مساهمة إجبارية في التأمين على التقاعد
he: תרומה חובה לביטוח פנסיה
ru: Обязательный взнос в пенсионное страхование

source: Health Insurance
ar: التأمين الصحي
he: ביטוח בריאות
ru: Медицинское страхование

source: Mandatory health insurance contribution
ar: مساهمة إجبارية في التأمين الصحي
he: תרומה חובה לביטוח בריאות
ru: Обязательный взнос в медицинское страхование

source: Unemployment Insurance
ar: تأمين البطالة
he: ביטוח אבטלה
ru: Страхование от безработицы

source: Mandatory unemployment insurance contribution
ar: مساهمة إجبارية في تأمين البطالة
he: תרומה חובה לביטוח אבטלה
ru: Обязательный взнос в страхование от безработицы

source: Long_Term_Care Insurance
ar: تأمين الرعاية طويلة الأمد
he: ביטוח סיעוד
ru: Страхование долгосрочного ухода

source: Mandatory long_term_care insurance contribution
ar: مساهمة إجبارية في تأمين الرعاية طويلة الأمد
he: תרומה חובה לביטוח סיעוד
ru: Обязательный взнос в страхование долгосрочного ухода

source: Income Tax
ar: ضريبة الدخل
he: מס הכנסה
ru: Подоходный налог

source: Progressive income tax
ar: ضريبة دخل تصاعدية
he: מס הכנסה פרוגרסיבי
ru: Прогрессивный подоходный налог

source: Solidarity Surcharge
ar: رسوم التضامن
he: תוספת סולידריות
ru: Солидарный взнос

source: Solidarity surcharge on income tax
ar: رسوم التضامن على ضريبة الدخل
he: תוספת סולידריות על מס הכנסה
ru: Солидарный взнос с подоходного налога

source: Social Security
ar: التأمينات الاجتماعية
he: ביטוח לאומי
ru: Социальное обеспечение

source: Social security contributions (employee portion) + MEI
ar: مساهمات التأمينات الاجتماعية (جزء الموظف) + MEI
he: תרומות ביטוח לאומי (חלק העובד) + MEI
ru: Взносы в социальное обеспечение (доля работника) + MEI

source: Social security contributions (self-declared income basis)
ar: مساهمات التأمينات الاجتماعية (على أساس الدخل المعلن ذاتياً)
he: תרומות ביטוח לאומי (בסיס הכנסה מוצהר עצמית)
ru: Взносы в социальное обеспечение (на основе самостоятельно заявленного дохода)

source: Health insurance contributions (self-declared income basis)
ar: مساهمات التأمين الصحي (على أساس الدخل المعلن ذاتياً)
he: תרומות ביטוח בריאות (בסיס הכנסה מוצהר עצמית)
ru: Взносы в медицинское страхование (на основе самостоятельно заявленного дохода)

source: Flat 10% income tax on profit
ar: ضريبة دخل ثابتة 10% على الربح
he: מס הכנסה שטוח 10% על רווח
ru: Плоский 10% подоходный налог с прибыли

source: National Insurance
ar: التأمين الوطني
he: ביטוח לאומי
ru: Национальное страхование

source: Mandatory national insurance contribution (Bituach Leumi)
ar: مساهمة إجبارية في التأمين الوطني (بيتواح لئومي)
he: תרומה חובה לביטוח לאומי (ביטוח לאומי)
ru: Обязательный взнос в национальное страхование (Битуах Леуми)

source: Health Tax
ar: ضريبة الصحة
he: מס בריאות
ru: Налог на здравоохранение

source: Mandatory health tax contribution (Mas Briut)
ar: مساهمة إجبارية في ضريبة الصحة (ماس بريوت)
he: תרומה חובה למס בריאות (מס בריאות)
ru: Обязательный взнос в налог на здравоохранение (Мас Бриут)

source: Pension
ar: التقاعد
he: פנסיה
ru: Пенсия

source: Pension fund contribution (Gemel Pensia)
ar: مساهمة في صندوق التقاعد (جمل بنسيا)
he: תרומה לקרן פנסיה (גמל פנסיה)
ru: Взнос в пенсионный фонд (Гемель Пенсия)

source: Keren Hishtalmut
ar: كيرين هشتالموت
he: קרן השתלמות
ru: Керен Хиштальмут

source: Advanced training fund contribution (Keren Hishtalmut)
ar: مساهمة في صندوق التدريب المتقدم (كيرين هشتالموت)
he: תרומה לקרן השתלמות (קרן השתלמות)
ru: Взнос в фонд повышения квалификации (Керен Хиштальмут)

source: Old-Age Insurance (Base)
ar: تأمين الشيخوخة (أساسي)
he: ביטוח זקנה (בסיסי)
ru: Страхование по старости (базовое)

source: Pension contributions up to SS ceiling
ar: مساهمات التقاعد حتى سقف التأمينات الاجتماعية
he: תרומות פנסיה עד תקרת ביטוח לאומי
ru: Пенсионные взносы до потолка социального страхования

source: Old-Age Insurance (Supplementary)
ar: تأمين الشيخوخة (مكمل)
he: ביטוח זקנה (משלים)
ru: Страхование по старости (дополнительное)

source: Pension contributions on full salary
ar: مساهمات التقاعد على الراتب الكامل
he: תרומות פנסיה על משכורת מלאה
ru: Пенсионные взносы с полной зарплаты

source: CSG (General Social Contribution)
ar: CSG (المساهمة الاجتماعية العامة)
he: CSG (תרומה חברתית כללית)
ru: CSG (Общий социальный взнос)

source: Funds social security (partially tax-deductible)
ar: يمول التأمينات الاجتماعية (قابل للخصم جزئياً من الضريبة)
he: מממן ביטוח לאומי (ניתן לניכוי חלקי במס)
ru: Финансирует социальное обеспечение (частично вычитается из налогов)

source: CRDS (Social Debt Repayment)
ar: CRDS (سداد الدين الاجتماعي)
he: CRDS (פירעון חוב חברתי)
ru: CRDS (Погашение социального долга)

source: Repayment of social security debt
ar: سداد دين التأمينات الاجتماعية
he: פירעון חוב ביטוח לאומי
ru: Погашение долга социального обеспечения

source: Supplementary Pension (Bracket 1)
ar: تقاعد مكمل (شريحة 1)
he: פנסיה משלימה (סוגר 1)
ru: Дополнительная пенсия (скобка 1)

source: Agirc-Arrco pension - up to ceiling
ar: تقاعد Agirc-Arrco - حتى السقف
he: פנסיה Agirc-Arrco - עד תקרה
ru: Пенсия Agirc-Arrco - до потолка

source: Supplementary Pension (Bracket 2)
ar: تقاعد مكمل (شريحة 2)
he: פנסיה משלימה (סוגר 2)
ru: Дополнительная пенсия (скобка 2)

source: Agirc-Arrco pension - above ceiling
ar: تقاعد Agirc-Arrco - فوق السقف
he: פנסיה Agirc-Arrco - מעל תקרה
ru: Пенсия Agirc-Arrco - выше потолка

source: CEG (Balance Contribution - B1)
ar: CEG (مساهمة التوازن - B1)
he: CEG (תרומת איזון - B1)
ru: CEG (Взнос баланса - B1)

source: Contribution for pension balance
ar: مساهمة لتوازن التقاعد
he: תרומה לאיזון פנסיה
ru: Взнос для пенсионного баланса

source: CEG (Balance Contribution - B2)
ar: CEG (مساهمة التوازن - B2)
he: CEG (תרומת איזון - B2)
ru: CEG (Взнос баланса - B2)

source: Contribution for pension balance - above ceiling
ar: مساهمة لتوازن التقاعد - فوق السقف
he: תרומה לאיזון פנסיה - מעל תקרה
ru: Взнос для пенсионного баланса - выше потолка

source: Two-tier income tax
ar: ضريبة دخل ثنائية المستوى
he: מס הכנסה דו-שלבי
ru: Двухуровневый подоходный налог

source: Income tax on 40% of gross income with standard discount
ar: ضريبة دخل على 40% من الدخل الإجمالي مع خصم قياسي
he: מס הכנסה על 40% מההכנסה ברוטו עם הנחה סטנדרטית
ru: Подоходный налог с 40% валового дохода со стандартной скидкой

source: Social security contribution on 50% of taxable income
ar: مساهمة التأمينات الاجتماعية على 50% من الدخل الخاضع للضريبة
he: תרומה לביטוח לאומי על 50% מההכנסה החייבת במס
ru: Взнос в социальное обеспечение с 50% налогооблагаемого дохода

source: Health insurance contribution on 50% of taxable income
ar: مساهمة التأمين الصحي على 50% من الدخل الخاضع للضريبة
he: תרומה לביטוח בריאות על 50% מההכנסה החייבת במס
ru: Взнос в медицинское страхование с 50% налогооблагаемого дохода

source: Microenterprise Tax
ar: ضريبة المؤسسات الصغيرة
he: מס מיקרו-עסק
ru: Налог на микропредприятие

source: 1% tax on gross revenue (microenterprise regime)
ar: ضريبة 1% على الإيرادات الإجمالية (نظام المؤسسات الصغيرة)
he: מס 1% על הכנסה ברוטו (משטר מיקרו-עסק)
ru: 1% налог с валовой выручки (режим микропредприятия)

source: Dividend Tax (8%)
ar: ضريبة الأرباح (8%)
he: מס דיבידנד (8%)
ru: Налог на дивиденды (8%)

source: 8% tax on dividend distribution (when extracting profits)
ar: ضريبة 8% على توزيع الأرباح (عند استخراج الأرباح)
he: מס 8% על חלוקת דיבידנדים (בעת משיכת רווחים)
ru: 8% налог на распределение дивидендов (при извлечении прибыли)

source: Mandatory health insurance (minimum basis ~€720/year)
ar: تأمين صحي إجباري (أساس أدنى ~€720/سنة)
he: ביטוח בריאות חובה (בסיס מינימלי ~€720/שנה)
ru: Обязательное медицинское страхование (минимальная база ~€720/год)

source: Social Security (Optional)
ar: التأمينات الاجتماعية (اختياري)
he: ביטוח לאומי (אופציונלי)
ru: Социальное обеспечение (добровольное)

source: Optional social security for pension rights (~€4,000/year recommended)
ar: تأمينات اجتماعية اختيارية لحقوق التقاعد (~€4,000/سنة موصى بها)
he: ביטוח לאומי אופציונלי לזכויות פנסיה (~€4,000/שנה מומלץ)
ru: Добровольное социальное обеспечение для пенсионных прав (~€4,000/год рекомендуется)

source: Social Security (TSU)
ar: التأمينات الاجتماعية (TSU)
he: ביטוח לאומי (TSU)
ru: Социальное обеспечение (TSU)

source: Social security contributions (employee portion)
ar: مساهمات التأمينات الاجتماعية (جزء الموظف)
he: תרומות ביטוח לאומי (חלק העובד)
ru: Взносы в социальное обеспечение (доля работника)

source: Income Tax (IRS)
ar: ضريبة الدخل (IRS)
he: מס הכנסה (IRS)
ru: Подоходный налог (IRS)

source: Social security on 70% of gross income (freelancer rate)
ar: تأمينات اجتماعية على 70% من الدخل الإجمالي (معدل المستقل)
he: ביטוח לאומי על 70% מההכנסה ברוטו (שיעור פרילנסר)
ru: Социальное обеспечение с 70% валового дохода (ставка фрилансера)

source: Progressive income tax on 25% of income (75% deemed expenses)
ar: ضريبة دخل تصاعدية على 25% من الدخل (75% نفقات مفترضة)
he: מס הכנסה פרוגרסיבי על 25% מההכנסה (75% הוצאות מונחות)
ru: Прогрессивный подоходный налог с 25% дохода (75% предполагаемых расходов)

source: Germany Salaried Employee
ar: موظف ألماني
he: עובד שכיר גרמניה
ru: Наемный работник Германии

source: France Salaried Employee
ar: موظف فرنسي
he: עובד שכיר צרפת
ru: Наемный работник Франции

source: Madrid Salaried Employee
ar: موظف مدريد
he: עובד שכיר מדריד
ru: Наемный работник Мадрида

source: Barcelona Salaried Employee
ar: موظف برشلونة
he: עובד שכיר ברצלונה
ru: Наемный работник Барселоны

source: Valencia Salaried Employee
ar: موظف فالنسيا
he: עובד שכיר ולנסיה
ru: Наемный работник Валенсии

source: Portugal Salaried Employee
ar: موظف برتغالي
he: עובד שכיר פורטוגל
ru: Наемный работник Португалии

source: Portugal Freelancer
ar: مستقل برتغالي
he: פרילנסר פורטוגל
ru: Фрилансер Португалии

source: Israel Salaried Employee
ar: موظف إسرائيلي
he: עובד שכיר ישראל
ru: Наемный работник Израиля

source: Bulgaria Freelancer
ar: مستقل بلغاري
he: פרילנסר בולגריה
ru: Фрилансер Болгарии

source: Romania Freelancer
ar: مستقل روماني
he: פרילנסר רומניה
ru: Фрилансер Румынии

source: Czechia Salaried Employee
ar: موظف تشيكي
he: עובד שכיר צ'כיה
ru: Наемный работник Чехии

source: Czechia Freelancer
ar: مستقل تشيكي
he: פרילנסר צ'כיה
ru: Фрилансер Чехии

source: Germany
ar: ألمانيا
he: גרמניה
ru: Германия

source: France
ar: فرنسا
he: צרפת
ru: Франция

source: Spain
ar: إسبانيا
he: ספרד
ru: Испания

source: Portugal
ar: البرتغال
he: פורטוגל
ru: Португалия

source: Israel
ar: إسرائيل
he: ישראל
ru: Израиль

source: Bulgaria
ar: بلغاريا
he: בולגריה
ru: Болгария

source: Romania
ar: رومانيا
he: רומניה
ru: Румыния

source: Czechia
ar: التشيك
he: צ'כיה
ru: Чехия

source: Salaried
ar: موظف
he: עובד שכיר
ru: Наемный работник

source: Freelancer
ar: مستقل
he: פרילנסר
ru: Фрилансер

source: Mandatory social security contribution
he: תרומה חובה לביטוח לאומי
ru: Обязательный взнос в социальное обеспечение

source: Gross:
ar: إجمالي:
he: ברוטו:
ru: Валовая:

source: Net:
ar: صافي:
he: נטו:
ru: Чистая:

source: Language
ar: اللغة
he: שפה

source: Tax Regime
ar: نظام الضرائب
he: משטר מס
